[{"description": "many poor and oppressed people wish to leave their countries of origin in the third world to come to affluent Western societies ", "title": "poor and oppressed people want to go to affluent Western societies", "related": [], "past": [4], "future": [6], "keywords": [], "type": "definition", "id": 1}, {"description": "What justifies our Western use of force against such poor and oppressed people? ", "title": "What justifies our Western use of force against such poor and oppressed people?", "related": [], "past": [], "future": [3, 4, 5], "keywords": [], "type": "question", "id": 2}, {"description": "perhaps borders and guards can be justified as a way of keeping out criminals, subversives, or armed invaders ", "title": "perhaps borders and guards can be justified as a way of keeping out criminals, subversives, or armed invaders", "related": [], "past": [2], "future": [], "keywords": [], "type": "definition", "id": 3}, {"description": "But most are not like this; they are ordinary, peaceful people trying to get iin seeking only the opportunity to build decent, secure lives for themselves and their families ", "title": "ordinary, peaceful people trying to seek the opportunity to build decent, secure lives", "related": [], "past": [2], "future": [1], "keywords": [], "type": "definition", "id": 4}, {"description": "To most people the answer to this question will seem obvious. The power to admit or exclude aliens is inherent in sovereignty and essential for any political community. Every state has the legal and moral right to exercise that power in pursuit of its own national interest, even if that means denying entry to peaceful, needy foreigners. They are under no obligation to admit immigrants. ", "title": "states and soverignty have power in immigration as well as to deny entry", "related": [], "past": [2], "future": [], "keywords": [], "type": "definition", "id": 5}, {"description": "citizenship in western liberal democracies is the modern equivalent of feudal privilege ", "title": "citizenship in western democracies is the modern equivalent of feudal privilege", "related": [], "past": [1], "future": [], "keywords": [], "type": "definition", "id": 6}, {"description": "One popular position on immigration goes something like this where \"It's our country. We can let in or keep out whomever we want.\" ", "title": "It's our country. We can let in whomever we want", "related": [], "past": [], "future": [8, 19, 24], "keywords": [], "type": "definition", "id": 7}, {"description": "This can be based on property rights as a country, collective or national. ", "title": "country as collective or national property rights", "related": [], "past": [7], "future": [9, 17, 19], "keywords": [], "type": "definition", "id": 8}, {"description": "Theories emphasize individual property rights and the concept of collective or national property rights would undermine the individual rights that these theories wish to protect ", "title": "individual rights are emphasized and collective rights would undermine these individual rights", "related": [], "past": [8], "future": [10, 17, 19, 21], "keywords": [], "type": "implication", "id": 9}, {"description": "Nozick assumes that individuals in the state of nature have rights, including the right to acquire and use property. All individuals have the same rights, although the exercise of those rights leads to material inequalities. ", "title": "Nozick assumes all individuals have the same natural rights", "related": [], "past": [9], "future": [11, 13, 14, 15, 16, 18, 19, 20, 21, 26, 35, 36], "keywords": [], "type": "definition", "id": 10}, {"description": "The inconveniences of the state of nature justify the creation of a minimal state whose sole task is to protect people within a given territory against violations of their rights ", "title": "inconveniences of the state of nature justify the creation of a minimal state that protects only convenient people", "related": [], "past": [10], "future": [12], "keywords": [], "type": "definition", "id": 11}, {"description": "Would this minimal state be justified in restricting immigration? ", "title": "Would this minimal state be justified in restricting immigration?", "related": [], "past": [11, 14], "future": [13], "keywords": [], "type": "question", "id": 12}, {"description": "Nozick argument says a state has no right to do anything other than enforce the rights which individuals already enjoy in the state of nature. State is obliged because it enjoys de facto monopoly over enforcement of rights within its territory. State may not interfere with such exchanges such as between individuals so long as they do not violate someone else' rights ", "title": "Nozick states that state has to enforce rights and protect them. They cannot infringe on rights", "related": [], "past": [12, 10, 14], "future": [15, 18, 20], "keywords": [], "type": "definition", "id": 13}, {"description": "so long as individuals did not violate the rights of other individuals, their entry and their actions would be none of the states business ", "title": "so long as individuals did not violate the rights of other individuals, their entry and their actions would be none of the states business ", "related": [], "past": [10], "future": [12, 13], "keywords": [], "type": "definition", "id": 14}, {"description": "Does this mean Nozick's theory provides no basis for the exclusion of aliens? ", "title": "Does this mean Nozick's theory provides no basis for the exclusion of aliens?", "related": [], "past": [10, 13], "future": [16], "keywords": [], "type": "question", "id": 15}, {"description": "Nozick provides no basis for the state to exclude aliens and no basis for individuals to exclude aliens that could not be used to exclude citizens as well. Poor aliens AND poor citizens could not afford to live in affluent suburbs, and individual property owners could refuse to hire aliens or sell goods but in a Nozickean world they could do that to fellow individual citizens. ", "title": "Nozick provides no basis to exclude aliens without excluding citizens as well. Both individual and alien are equal in Nozick", "related": [], "past": [10, 15], "future": [20], "keywords": [], "type": "definition", "id": 16}, {"description": "Is there any room for collective action to restrict entry in Nozick's theory? ", "title": "Is there any room for collective action to restrict entry in Nozick's theory?", "related": [], "past": [8, 9], "future": [18, 19], "keywords": [], "type": "question", "id": 17}, {"description": "People may voluntarily construct small communities or pool their property to make collective decisions on basis of majority rule with Nozick. But such a community may also redistribute property as it chooses unlike the state. ", "title": "People may voluntarily construct small communities or pool their property to make collective decisions on basis of majority rule with Nozick", "related": [], "past": [17, 10, 13], "future": [19], "keywords": [], "type": "definition", "id": 18}, {"description": "It's our country narrative is always incompatible with a property rights theory like Nozick. Property cannot serve as a protection for individuals against the collective if the property is collectively owned. If such is the case, then it can be used to justify redistributing income or whatever else the majority decides, such as land. ", "title": "collective incompatible with a property rights theory like Nozick", "related": [], "past": [18, 7, 10, 8, 9, 17], "future": [20], "keywords": [], "type": "implication", "id": 19}, {"description": "The land of the nation is not the collective property of its citizens. Control of the state is limited to enforcement of the rights of individual owners. The state has no right to restrict immigration. ", "title": "The state has no right to restrict immigration because the land of the nation is not the collective property or community of its citizens", "related": [], "past": [19, 13, 16, 10], "future": [], "keywords": [], "type": "definition", "id": 20}, {"description": "Rawle provides a justification for an activist state with positive responsibilities for social welfare, in contrast to Nozick.  ", "title": "Rawls says the state can be activist with responsibility for social welfare", "related": [], "past": [9, 10, 22, 23, 27, 31, 33], "future": [38, 37], "keywords": [], "type": ["definition"], "id": 21}, {"description": "Rawles leaves little room for restrictions in principle because he explicitly assumes a closed system in which immigration does not arise ", "title": "Rawls leaves little room for restrictions in principle because he assumes a closed system where immigration does not arise", "related": [], "past": [], "future": [21, 23], "keywords": [], "type": [], "id": 22}, {"description": "Rawls' approach is applicable to a broader context than the one he considers ", "title": "Rawls' approach is applicable to a broader context than the one he considers", "related": [], "past": [22, 31, 33], "future": [21], "keywords": [], "type": ["implication"], "id": 23}, {"description": "Rawls asks what principles people would choose to govern society if they had to choose from behind a veil of ignorance, knowing nothing from their o own personal situations. ", "title": "Rawls principles behind a veil of ignorance", "related": [], "past": [7], "future": [25, 29, 30, 31, 32, 34, 35, 36, 37, 39, 40], "keywords": [], "type": ["definition"], "id": 24}, {"description": "Rawls argues that people in this original position would choose two principles ", "title": "Rawls argues people in veil of ignorance would choose two principles", "related": [], "past": [24], "future": [26, 27, 29, 30, 31, 32, 34, 39, 40], "keywords": [], "type": ["implication"], "id": 25}, {"description": "The first Rawls principle would guarantee equal liberty to all   ", "title": "first Rawls principle would guarantee equal liberty to all", "related": [], "past": [25, 10], "future": [28, 29, 30, 31, 32, 34, 35, 36, 38, 39, 40, 41, 42], "keywords": [], "type": ["definition"], "id": 26}, {"description": "The second principle would permit social and economic inequalities so long as they were to the advantage of the least well off and attached to positions open to all under fair conditions of equal opportunity ", "title": "second Rawls principle would permit social and economic inequality so long as they were to the advantage of the least well off and open to all under fair conditions of equal opportunity", "related": [], "past": [25, 28], "future": [21, 29, 30, 31, 32, 34, 38, 39, 40, 41], "keywords": [], "type": [], "id": 27}, {"description": "people in the original position would give priority to the first principle, forbidding a reduction of basic liberties for the sake of economic gain ", "title": "priority to the first principle to forbid a reduction of basic liberties for the sake of economic gain", "related": [], "past": [26], "future": [27], "keywords": [], "type": ["implication"], "id": 28}, {"description": "ideal theory one assumes that even after the veil of ignorance is lifted, people will accept and generally abide by the principles chosen in the original position and that there are no historical obstacles to the realization of just institutions. ", "title": "ideal theory assumes even after veil of ignorance is lifted people will abide by the principles", "related": [], "past": [24, 25, 26, 27], "future": [37, 43], "keywords": [], "type": ["definition"], "id": 29}, {"description": "nonideal theory is when one takes account of both historical obstacles and the unjust actions of others ", "title": "nonideal theory when one takes account of both historical obstacles and the unjust actions of others", "related": [], "past": [24, 25, 26, 27], "future": [], "keywords": [], "type": ["definition"], "id": 30}, {"description": "the veil of ignorance creates reasons where thinking about questions of justice within a given society also make it useful for thinking about justice across different societies ", "title": "veil of ignorance makes it useful to think about justice across different societies", "related": [], "past": [24, 25, 26, 27], "future": [21, 23], "keywords": [], "type": ["implication"], "id": 31}, {"description": "natural and social contingencies are arbitrary from a moral point of view and therefore are factors which ought not to influence the choice of principles of justice by veil of ignorance ", "title": "veil of ignorance allows natural and social contingencies to be arbitrary and not factors of justice or principles", "related": [], "past": [24, 25, 26, 27], "future": [33], "keywords": [], "type": [], "id": 32}, {"description": "a fair procedure for choosing principles of justice must therefore exclude knowledge of these circumstances behind the veil of ignorance. We should therefore take a global, not a national, view of the original position ", "title": "fair procedure for choosing principles of justice must be behind the veil of ignorance thus we should take a global view", "related": [], "past": [32, 36], "future": [21, 23, 37], "keywords": [], "type": [], "id": 33}, {"description": "one objection to this global approach to Rawls' use of the original position and the veil of ignorance depends on a characteristic of modern democratic societies but may not be shared by other societies ", "title": "other societies not democratic may not have the original position and same values behind the veil of ignorance", "related": [], "past": [24, 25, 26, 27], "future": [], "keywords": [], "type": [], "id": 34}, {"description": "understanding of moral personality in question is that essentially all people are free and equal moral persons ", "title": "moral personality says all people are free and equal", "related": [], "past": [10, 26, 24], "future": [36], "keywords": [], "type": ["definition"], "id": 35}, {"description": "even if moral personality is not shared by people in other societies, it is not a view that applies only to people who share it. We criticize people without our views, but we do not deprive them of their rights because of their beliefs ", "title": "even if the values are not shared in moral personality, we do not deprive them of their rights", "related": [], "past": [35, 24, 26, 10], "future": [33], "keywords": [], "type": ["implication"], "id": 36}, {"description": "in ideal theory, some of the reasons for defending the integrity of existing states dissapear. But ideal theory does not require the elimination of all linguistic, cultural, and historical differences. State sovereignty would be morally constrained by the principles of justice ", "title": "ideal theory creates states but morally constrained by just institutions", "related": [], "past": [29, 24, 33, 21], "future": [38, 43], "keywords": [], "type": ["implication"], "id": 37}, {"description": "economic opportunities for particular individuals may vary greatly between states. Is freedom of movement a basic right among states? ", "title": "Is freedom of movement a basic right among states?", "related": [], "past": [37, 21, 26, 27], "future": [40], "keywords": [], "type": ["question"], "id": 38}, {"description": "who would be the most disadvantaged by the restrictions, in this case of immigration ", "title": "disadvantaged caused by immigration", "related": [], "past": [27, 26, 25, 24], "future": [40], "keywords": [], "type": ["implication"], "id": 39}, {"description": "assume immigration is a basic right and liberty ", "title": "immigration is a basic right and liberty", "related": [], "past": [24, 25, 26, 27, 39, 38], "future": [41, 43], "keywords": [], "type": ["definition"], "id": 40}, {"description": "liberty may be restricted for the sake of liberty, depending on the existence of public order and security ", "title": "public order restriction", "related": [], "past": [26, 27, 40], "future": [42, 43], "keywords": [], "type": ["definition"], "id": 41}, {"description": "Rawls warns against any attempt to use this sort of public order in an expansive fashion or as an excuse for restrictions on liberty undertaken for other rreasons. The hypothetical possibility of a threat is not enough. Restrictions would be justified only if there were reasonable expectation that unlimited immigration would damage the public order and this expectation would have to be based on evidence and ways of reasoning acceptable to all. Only to preserve public order. ", "title": "Rawls warns against any attempt to use public order in an expansive fashion or for an excuse to restrict liberty for other reasons", "related": [], "past": [41, 26], "future": [43], "keywords": [], "type": ["definition"], "id": 42}, {"description": "There is little room for restrictions in ideal theory, since people and states are just ", "title": "There is little room for restrictions in ideal theory, since people and states are just", "related": [], "past": [29, 37, 42, 41, 40], "future": [], "keywords": [], "type": ["implication"], "id": 43}]